"Please Donate" = "Proszę wspomóż";
"Donate" = "Wspomóż!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Rozwój tej aplikacji zajął wiele nocy. Jeśli lubisz jej używać, rozważ proszę by wspomóc autora (to ja!) programu. To zdopinguje mnie, by nieustannie go ulepszać, naprawdę!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "As a contributor to Cyberduck, you receive a registration key that disables this prompt.";
"Thank you for using Cyberduck!" = "Dzięki za używanie programu Cyberduck!";
"Later" = "Później";
"Don't show again for this version" = "Nie pokazuj tego ponownie";
"Registration Key" = "Registration Key";

"Buy in Windows Store" = "Kup w Windows Store";
"Buy in Mac App Store" = "Kup w Mac App Store";
